<?php

return [
    'password_confirm' => [
        'heading' => 'პაროლის დადასტურება',
        'description' => 'გთხოვთ დაადასტუროთ პაროლი ამ მოქმედების დასასრულებლად.',
        'current_password' => 'მიმდინარე პაროლი',
    ],
    'two_factor' => [
        'heading' => 'ორფაქტორიანი შემოწმება',
        'description' => 'გთხოვთ დაადასტუროთ წვდომა თქვენს ანგარიშზე, ავტორიზაციის აპლიკაციის მიერ მოწოდებული კოდის შეყვანით.',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'ორფაქტორიანი შემოწმება',
            'description' => 'გთხოვთ დაადასტუროთ წვდომა თქვენს ანგარიშზე, ერთ-ერთი სარეზერვო აღდგენის კოდის შეყვანით.',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'დაკარგეთ მოწყობილობა?',
        'recovery_code_link' => 'სარეზერვო კოდის გამოყენება',
        'back_to_login_link' => 'შესვლის გვერდზე დაბრუნება',
    ],
    'passkeys' => [
        'authenticate_using_passkey' => [
            'label' => 'ავტორიზაცია Passkey-ით',
        ],
        'invalid' => 'ვერ მოხერხდა შესვლა მითითებული Passkey-ით.',
    ],
    'profile' => [
        'account' => 'ანგარიში',
        'profile' => 'პროფილი',
        'my_profile' => 'ჩემი პროფილი',
        'subheading' => 'მართეთ თქვენი მომხმარებლის პროფილი აქ.',
        'personal_info' => [
            'heading' => 'პირადი ინფორმაცია',
            'subheading' => 'მართეთ თქვენი პირადი ინფორმაცია.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პროფილი წარმატებით განახლდა!',
        ],
        'password' => [
            'heading' => 'პაროლი',
            'subheading' => 'უნდა შეიცავდეს მინიმუმ 8 სიმბოლოს.',
            'submit' => [
                'label' => 'განახლება',
            ],
            'notify' => 'პაროლი წარმატებით განახლდა!',
        ],
        '2fa' => [
            'title' => 'ორფაქტორიანი ავთენტიფიკაცია',
            'description' => 'მართეთ ორფაქტორიანი ავთენტიფიკაცია თქვენი ანგარიშისთვის (რეკომენდებულია).',
            'actions' => [
                'enable' => 'ჩართვა',
                'regenerate_codes' => 'აღდგენის კოდების ხელახლა გენერაცია',
                'disable' => 'გამორთვა',
                'confirm_finish' => 'დადასტურება და დასრულება',
                'cancel_setup' => 'გაწყობის გაუქმება',
                'confirm' => 'დადასტურება',
            ],
            'setup_key' => 'გაწყობის გასაღები',
            'must_enable' => 'ამ აპლიკაციის გამოსაყენებლად უნდა ჩართოთ ორფაქტორიანი ავთენტიფიკაცია.',
            'not_enabled' => [
                'title' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართული არ არის.',
                'description' => 'ორფაქტორიანი ავთენტიფიკაციის ჩართვის შემთხვევაში, ავტორიზაციისას მოგეთხოვებათ უსაფრთხო, შემთხვევითი კოდი. ეს კოდი შეგიძლიათ მიიღოთ თქვენი ტელეფონის ავტორიზაციის აპლიკაციიდან (მაგ. Microsoft Authenticator, Google Authenticator).',
            ],
            'finish_enabling' => [
                'title' => 'დაასრულეთ ორფაქტორიანი ავთენტიფიკაციის ჩართვა.',
                'description' => 'ორფაქტორიანი ავთენტიფიკაციის ჩართვის დასასრულებლად, დაასკანერეთ ქვემოთ მოცემული QR კოდი ავტორიზაციის აპლიკაციით ან შეიყვანეთ გაწყობის გასაღები და მიღებული ერთჯერადი კოდი (OTP).',
            ],
            'enabled' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართულია.',
                'title' => 'ორფაქტორიანი ავთენტიფიკაცია ჩართული გაქვთ!',
                'description' => 'ორფაქტორიანი ავთენტიფიკაცია ახლა ჩართულია. ეს ზრდის თქვენი ანგარიშის უსაფრთხოებას.',
                'store_codes' => 'ეს კოდები გამოგადგებათ ანგარიშზე წვდომის აღსადგენად მოწყობილობის დაკარგვის შემთხვევაში. გაფრთხილება! ეს კოდები მხოლოდ ერთხელ გამოჩნდება.',
            ],
            'disabling' => [
                'notify' => 'ორფაქტორიანი ავთენტიფიკაცია გამორთულია.',
            ],
            'regenerate_codes' => [
                'notify' => 'ახალი აღდგენის კოდები შეიქმნა.',
            ],
            'confirmation' => [
                'success_notification' => 'კოდი დადასტურებულია. ორფაქტორიანი ავთენტიფიკაცია ჩართულია.',
                'invalid_code' => 'შეყვანილი კოდი არასწორია.',
            ],
        ],
        'sanctum' => [
            'title' => 'API ტოკენები',
            'description' => 'მართეთ API ტოკენები, რომლებიც მესამე მხარის სერვისებს აძლევს წვდომას ამ აპლიკაციაზე თქვენი სახელით.',
            'create' => [
                'notify' => 'ტოკენი წარმატებით შეიქმნა!',
                'message' => 'თქვენი ტოკენი მხოლოდ შექმნისას გამოჩნდება ერთხელ. ტოკენის დაკარგვის შემთხვევაში, საჭირო იქნება მისი წაშლა და ახლის შექმნა.',
                'submit' => [
                    'label' => 'შექმნა',
                ],
            ],
            'update' => [
                'notify' => 'ტოკენი წარმატებით განახლდა!',
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
            'copied' => [
                'label' => 'ტოკენი დაკოპირებულია',
            ],
        ],
        'browser_sessions' => [
            'heading' => 'ბრაუზერის სესიები',
            'subheading' => 'მართეთ თქვენი აქტიური სესიები.',
            'label' => 'ბრაუზერის სესიები',
            'content' => 'საჭიროების შემთხვევაში, შეგიძლიათ გამოხვიდეთ თქვენი ყველა სხვა ბრაუზერის სესიიდან ყველა მოწყობილობაზე. ქვემოთ ჩამოთვლილია თქვენი ბოლოდროინდელი სესიების ნაწილი, თუმცა სია შეიძლება არ იყოს სრული. თუ ფიქრობთ, რომ თქვენი ანგარიში კომპრომეტირებულია, ასევე შეცვალეთ პაროლი.',
            'device' => 'ეს მოწყობილობა',
            'last_active' => 'ბოლო აქტივობა',
            'logout_other_sessions' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'logout_heading' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'logout_description' => 'გთხოვთ შეიყვანოთ პაროლი დასადასტურებლად, რომ გსურთ გამოსვლა თქვენი ყველა სხვა ბრაუზერის სესიიდან ყველა მოწყობილობაზე.',
            'logout_action' => 'სხვა ბრაუზერის სესიებიდან გამოსვლა',
            'incorrect_password' => 'შეყვანილი პაროლი არასწორია. გთხოვთ სცადოთ თავიდან.',
            'logout_success' => 'ყველა სხვა ბრაუზერის სესიიდან გამოსვლა წარმატებით განხორციელდა.',
        ],
        'passkeys' => [
            'heading' => 'Passkeys',
            'description' => 'მართეთ Passkeys უსაფრთხო და პაროლის გარეშე წვდომისთვის თქვენს ანგარიშზე სხვადასხვა მოწყობილობიდან.',
            'create' => [
                'submit' => [
                    'label' => 'შექმნა',
                    'submit_label' => 'შექმნა და ავტორიზაცია',
                ],
                'error_message' => 'Passkey-ის გენერირებისას მოხდა შეცდომა.',
                'success_message' => 'Passkey წარმატებით შეიქმნა.',
            ],
            'update' => [
                'submit' => [
                    'label' => 'განახლება',
                ],
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'კოპირება',
        'tooltip' => 'დაკოპირდა!',
    ],
    'fields' => [
        'avatar' => 'ავატარი',
        'email' => 'ელ-ფოსტა',
        'login' => 'შესვლა',
        'name' => 'სახელი',
        'password' => 'პაროლი',
        'password_confirm' => 'პაროლის დადასტურება',
        'new_password' => 'ახალი პაროლი',
        'new_password_confirmation' => 'პაროლის დადასტურება',
        'token_name' => 'ტოკენის სახელი',
        'token_expiry' => 'ტოკენის ვადა',
        'abilities' => 'უფლებები',
        '2fa_code' => 'კოდი',
        '2fa_recovery_code' => 'აღდგენის კოდი',
        'created' => 'შექმნილია',
        'expires' => 'იწურება',
        'passkey_name' => 'Passkey-ის სახელი',
        'last_used_at' => 'ბოლო გამოყენება',
    ],
    'permissions' => [
        'create' => 'შექმნა',
        'view' => 'ნახვა',
        'update' => 'განახლება',
        'delete' => 'წაშლა',
    ],
    'or' => 'ან',
    'cancel' => 'გაუქმება',
    'login' => [
        'username_or_email' => 'მომხმარებლის სახელი ან ელ-ფოსტა',
        'forgot_password_link' => 'დაგავიწყდათ პაროლი?',
        'create_an_account' => 'ანგარიშის შექმნა',
    ],
    'registration' => [
        'title' => 'რეგისტრაცია',
        'heading' => 'ახალი ანგარიშის შექმნა',
        'submit' => [
            'label' => 'რეგისტრაცია',
        ],
        'notification_unique' => 'ამ ელ-ფოსტით ანგარიში უკვე არსებობს. გთხოვთ შეხვიდეთ სისტემაში.',
    ],
    'reset_password' => [
        'title' => 'დაგავიწყდათ პაროლი?',
        'heading' => 'პაროლის აღდგენა',
        'submit' => [
            'label' => 'გაგზავნა',
        ],
        'notification_error' => 'შეცდომა: გთხოვთ სცადოთ მოგვიანებით.',
        'notification_error_link_text' => 'თავიდან ცდა',
        'notification_success' => 'შეამოწმეთ ელ-ფოსტა შემდგომი ინსტრუქციებისთვის!',
    ],
    'verification' => [
        'title' => 'ელ-ფოსტის დადასტურება',
        'heading' => 'საჭიროა ელ-ფოსტის დადასტურება',
        'submit' => [
            'label' => 'გამოსვლა',
        ],
        'notification_success' => 'შეამოწმეთ ელ-ფოსტა შემდგომი ინსტრუქციებისთვის!',
        'notification_resend' => 'ახალი დამადასტურებელი წერილი გაიგზავნა.',
        'before_proceeding' => 'გაგრძელებამდე, გთხოვთ შეამოწმოთ ელ-ფოსტა დამადასტურებელი ბმულისთვის.',
        'not_receive' => 'თუ წერილი არ მიგიღიათ,',
        'request_another' => 'დააჭირეთ აქ ხელახლა გასაგზავნად',
    ],
];
